#Напишите программу, которая добавляет ‘ing’ к словам

a = str(input("Input verb\n"))
print(a + "ing")

