# Дан список: l=[‘Ivan’, ‘Ivanou’], и 2 строки: а=Minsk, с=Belarus.
# Напечатайте текст: “Привет, Ivan Ivanou! Добро пожаловать в Minsk Belarus”
l=["Ivan", "Ivanou"]
a = str("Minsk")
c = str("Belarus")
print(l[0], l[1]+"!", "Добро пожаловать в", a, c)