#string is интерабельные, не изменяемые, не уникальные, строки можно умножать и складывать
# если ввести r перед строкой, то пайтон будет читать как будет одну строку
# перемеенная.index(буква) - выдает индекс буквы, поиск сначала rindex - ищет с конца
# переменная.split() - строку разбивает по словам на список, a.split(sep="w") - указываем по каккому символовому разделяем
#sep - сепаратор
# end - конец строки, по умолчанию перенос строки
# f строка пример test = f"sdfsdf {a} sdfsdf {b}", где a и b - переменные, можно вызывать функции





# print(f"sdf {sdfs} sfasdf {"sdf" if b }")

# a =
# print(chr(a), ord('b'))


# a = "123"
# print(len(a))

# int_num = 1234
# # единицы
# print( int_num % 10)
# # десятки
# print(int_num % 10)


print(dir(int))

