#2) Дан список: l=[‘Ivan’, ‘Ivanou’], и 2 строки: а=Minsk, с=Belarus.
# Напечатайте текст: “Привет, Ivan Ivanou! Добро пожаловать в Minsk Belarus”

myCatName = ['Tuchtasun', "Ekaterinovich"]
country = "Uzbekistan"
city = "Tashkent"
name, lastName = myCatName # распаковка
print(f"Hello {name} {lastName} and Welcome to {country}, {city}!!")